'use strict';

var vgtrk = {
  728: [2412573],
  729: [2413715],
  730: [2415041],
  731: [2416394],
  732: [2417826],
  733: [2419236],
  734: [2420681],
  735: [2422028],
  736: [2423356],
  737: [2424713],
  738: [2426109],
  739: [2427545],
  740: [2429056],
  741: [2430386],
  742: [2431753, 'Новый Август',                '2019/08/04'],
  743: [2433117, 'Гараж',                       '2019/08/11'],
  744: [2434511, 'Новые имена # 24',            '2019/08/18'],
  745: [2435875, '7 поколений',                 '2019/08/25'],
  746: [2437276, 'Части Света 2019',            '2019/09/01'],
  747: [2438715, 'Новые песни сентября',        '2019/09/08'],
  748: [2440192, 'Не судьба',                   '2019/09/15'],
  749: [2441689, 'Ещё Новые Новые',             '2019/09/22'],
  750: [2443125, 'Blue Note Records',           '2019/09/29'],
  751: [2444568, 'Super Furry Animals',         '2019/10/06'],
  752: [2445977, 'Новые песни октября',         '2019/10/13'],
  753: [2447440, 'Поле и Обитатель Поля',       '2019/10/20'],
  754: [2448946, 'Новые имена #28',             '2019/10/27'],
  755: [2450450, 'Samhain 2019',                '2019/11/03'],
  756: [2451902, 'Преобразование Тома Уэйтса',  '2019/11/10'],
  757: [2453371, 'Новые песни ноября',          '2019/11/17'],
  758: [2454907, 'ELO: "Из ниоткуда" 2019',     '2019/11/24'],
  759: [2456411, 'То да сё № 5',                '2019/12/01'],
  760: [2457932, 'Новые песни декабря',         '2019/12/08'],
  761: [2459405, '"То да сё # 6" (Сила музыки)','2019/12/15'],
  762: [2460859, 'Рождество',                   '2019/12/22'],
  763: [2462338, 'С наступающим!',              '2019/12/29'],
  764: [2463470, 'Новогодние притчи',           '2020/01/05'],
  765: [2464622, 'Новые песни января',          '2020/01/12'],
  766: [2466052, 'The Cure',                    '2020/01/19'],
  767: [2467579, 'Новые имена 27',              '2020/01/26'],
  768: [2469082, 'Химолк',                      '2020/02/02'],
  769: [2470589, 'Новые песни февраля',         '2020/02/09'],
  770: [2472111, 'Nat King Cole',               '2020/02/16'],
  771: [2473604, 'Джордж и его друзья',         '2020/02/23'],
  772: [2474962, 'Новые песни в марте',         '2020/03/01'],
  773: [2476489, 'Песни для Богини',            '2020/03/08'],
  774: [2477843, 'То да сё 7',                  '2020/03/15'],
  775: [2479402, 'Новые имена #28',             '2020/03/22'],
  776: [2480863, 'Интуиция и сознание',         '2020/03/29'],
  777: [2482182, 'Новые песни апреля',          '2020/04/05'],
  778: [2483634, 'Новости музыки',              '2020/04/12'],
  779: [2485768, 'Пасха. Размышление',          '2020/04/19'],
  780: [2486634, 'Beltane 2020 – Dubliners',    '2020/04/26'],
  781: [2488057, 'Новые песни мая',             '2020/05/03'],
  782: [2489535, 'То да Сё №8',                 '2020/05/10'],
  783: [2490953, 'Глубокие песни Джорджа',      '2020/05/17'],
  784: [2492403, '15 лет Аэростатики',          '2020/05/24'],
  785: [2493882, 'Последний день Весны',        '2020/05/31'],
  786: [2495211, 'Новые песни июня',            '2020/06/07'],
  787: [2496662, 'Рок-звезда',                  '2020/06/14'],
  788: [2497674, 'Новый Альбом А',              '2020/06/21'],
  789: [2498706, 'Музыка "ревущих 20-х"',       '2020/06/28'],
  790: [2499939, 'Новые песни Июля',            '2020/07/05'],
  791: [2501227, 'Вслух о музыке',              '2020/07/12'],
  792: [2502586, 'Новые имена #29',             '2020/07/19'],
  793: [2504060, 'Демон Мечты',                 '2020/07/26'],
  794: [2505491, 'Лунассад',                    '2020/08/02'],
  795: [2506948, 'Новые песни августа',         '2020/08/09'],
  796: [2508348, 'О том да сём',                '2020/09/16'],
};

function getFileName (i) {
    return ('00' + i).slice(-3) + '.mp3';
    // if (i >= 600) {
    //     return i + '.mp3';
    // }
    // return 'Boris%20'
    //     + ((i < 284) ? 'Grebentshikov' : 'Grebenshchikov')
    //     + '%20-%20Aerostat%20Radio%20vol.' + i + '.mp3';
}

function getUrl (i) {
    if (i >= 728) {
      if (vgtrk[i] === undefined) {
        return;
      }
      return 'https://audio.vgtrk.com/listen?id=' + vgtrk[i][0];
    }
    return 'https://aerostatica.ru/music/' + getFileName(i);
    // return ((i >= 600) ?
    //     'https://aerostatica.ru/music' :
    //     'http://aquarium.lipetsk.ru/MESTA/mp3/Aerostat/Aerostat_vol_' + i
    // ) + '/' + getFileName(i);
}

module.exports = {
    getFileName: getFileName,
    getUrl: getUrl
};
