'use strict';

var vgtrk = {
  728: [2412573],
  729: [2413715],
  730: [2415041],
  731: [2416394],
  732: [2417826],
  733: [2419236],
  734: [2420681],
  735: [2422028],
  736: [2423356],
  737: [2424713],
  738: [2426109],
  739: [2427545],
  740: [2429056],
  741: [2430386],
  742: [2431753, 'Новый Август',                '2019/08/04'],
  743: [2433117, 'Гараж',                       '2019/08/11'],
  744: [2434511, 'Новые имена # 24',            '2019/08/18'],
  745: [2435875, '7 поколений',                 '2019/08/25'],
  746: [2437276, 'Части Света 2019',            '2019/09/01'],
  747: [2438715, 'Новые песни сентября',        '2019/09/08'],
  748: [2440192, 'Не судьба',                   '2019/09/15'],
  749: [2441689, 'Ещё Новые Новые',             '2019/09/22'],
  750: [2443125, 'Blue Note Records',           '2019/09/29'],
  751: [2444568, 'Super Furry Animals',         '2019/10/06'],
  752: [2445977, 'Новые песни октября',         '2019/10/13'],
  753: [2447440, 'Поле и Обитатель Поля',       '2019/10/20'],
  754: [2448946, 'Новые имена #28',             '2019/10/27'],
  755: [2450450, 'Samhain 2019',                '2019/11/03'],
  756: [2451902, 'Преобразование Тома Уэйтса',  '2019/11/10'],
  757: [2453371, 'Новые песни ноября',          '2019/11/17'],
  758: [2454907, 'ELO: "Из ниоткуда" 2019',     '2019/11/24'],
  759: [2456411, 'То да сё № 5',                '2019/12/01']
};

function getFileName (i) {
    return ('00' + i).slice(-3) + '.mp3';
    // if (i >= 600) {
    //     return i + '.mp3';
    // }
    // return 'Boris%20'
    //     + ((i < 284) ? 'Grebentshikov' : 'Grebenshchikov')
    //     + '%20-%20Aerostat%20Radio%20vol.' + i + '.mp3';
}

function getUrl (i) {
    if (i >= 728) {
      if (vgtrk[i] === undefined) {
        return;
      }
      return 'https://audio.vgtrk.com/listen?id=' + vgtrk[i][0];
    }
    return 'https://aerostatica.ru/music/' + getFileName(i);
    // return ((i >= 600) ?
    //     'https://aerostatica.ru/music' :
    //     'http://aquarium.lipetsk.ru/MESTA/mp3/Aerostat/Aerostat_vol_' + i
    // ) + '/' + getFileName(i);
}

module.exports = {
    getFileName: getFileName,
    getUrl: getUrl
};
